modm-ext/data.modm.io/docs/svd/header_stm32f303x8.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>COMP</name>
      <description>Analog Comparators</description>
      <groupName>COMP</groupName>
      <baseAddress>0x40010020</baseAddress>
      <registers>
        <register>
          <name>CSR</name>
          <description>COMP control and status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COMPxEN</name>
              <description>COMPx enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPxINSEL</name>
              <description>COMPx inverting input select</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>COMPxOUTSEL</name>
              <description>COMPx output select</description>
              <bitOffset>10</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>COMP output is not connected to other peripherals (except GPIO and EXTI that are always connected to COMP output) (specific to COMP instance: COMP2)</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_BKIN</name>
                  <description>COMP output connected to TIM1 break input (BKIN)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_BKIN2</name>
                  <description>COMP output connected to TIM1 break input 2 (BKIN2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OCCLR_COMP1_2_3</name>
                  <description>COMP output connected to TIM2 OCREF clear. Caution: Parameter specific to COMP instances, defined with generic naming, not taking into account COMP instance constraints. Refer to literal definitions above for COMP instance constraints.</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OCCLR_COMP2_4</name>
                  <description>COMP output connected to TIM3 OCREF clear (specific to COMP instance: COMP2, COMP4)</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_IC1_COMP2</name>
                  <description>COMP output connected to TIM1 input capture 1 (specific to COMP instance: COMP2)</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_IC4_COMP2</name>
                  <description>COMP output connected to TIM1 input capture 4 (specific to COMP instance: COMP2)</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_IC1_COMP2</name>
                  <description>COMP output connected to TIM3 input capture 1 (specific to COMP instance: COMP2)</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_IC3_COMP4</name>
                  <description>COMP output connected to TIM3 input capture 3 (specific to COMP instance: COMP4)</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxPOL</name>
              <description>COMPx output polarity</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONINVERTED</name>
                  <description>COMP output polarity is not inverted: comparator output is high when the plus (non-inverting) input is at a higher voltage than the minus (inverting) input</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>INVERTED</name>
                  <description>COMP output polarity is inverted: comparator output is low when the plus (non-inverting) input is at a lower voltage than the minus (inverting) input</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxBLANKING</name>
              <description>COMPx blanking</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description>Comparator output without blanking</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM1_OC5_COMP2</name>
                  <description>Comparator output blanking source TIM1 OC5 (specific to COMP instance: COMP2)</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM2_OC3_COMP2</name>
                  <description>Comparator output blanking source TIM2 OC3 (specific to COMP instance: COMP2)</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIM3_OC3_COMP2</name>
                  <description>Comparator output blanking source TIM3 OC3 (specific to COMP instance: COMP2)</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>COMPxINSEL_3</name>
              <description>COMPx inverting input select</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPxOUT</name>
              <description>COMPx output level</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPxLOCK</name>
              <description>COMPx lock</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
